In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
#lettura del file

file_path_movies = "Elenco_Movies_SAC.csv"
sdf = pd.read_csv(file_path_movies)
sdf

,MovieID,Title,Genres
0,1,Toy Story (1995),Animation|Children's|Comedy
1,2,Jumanji (1995),Adventure|Children's|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama
4,5,Father of the Bride Part II (1995),Comedy
...,...,...,...
3878,3948,Meet the Parents (2000),Comedy
3879,3949,Requiem for a Dream (2000),Drama
3880,3950,Tigerland (2000),Drama
3881,3951,Two Family House (2000),Drama
3882,3952,"Contender, The (2000)",Drama|Thriller

In [3]:
file_path_users = "users_edit.csv"
sdf_users = pd.read_csv(file_path_users)
sdf_users

      UserID Gender  Age    CAP           Work
0          1      F   11  20023       Studente
1          2      M   13  72022       Studente
2          3      M   24  36100        Autista
3          4      M   37  85024  Data Engineer
4          5      M   15   1010       Studente
...      ...    ...  ...    ...            ...
6035    6036      F   33  12032        Autista
6036    6037      F   59   9099      Dirigente
6037    6038      F   35  19020      Dirigente
6038    6039      F   52   1010    Disoccupato
6039    6040      M   15    153       Studente

[6040 rows x 5 columns]

In [4]:
file_path_ratings = "ratings_edit.csv"
sdf_ratings = pd.read_csv(file_path_ratings)
sdf_ratings

         UserID  MovieID  Rating  Timestamp
0             1     1193       5  978300760
1             1      661       3  978302109
2             1      914       3  978301968
3             1     3408       4  978300275
4             1     2355       5  978824291
...         ...      ...     ...        ...
1000204    6040     1091       1  956716541
1000205    6040     1094       5  956704887
1000206    6040      562       5  956704746
1000207    6040     1096       4  956715648
1000208    6040     1097       4  956715569

[1000209 rows x 4 columns]

In [5]:
sdf_ratings["Timestamp"] = pd.to_datetime(sdf_ratings["Timestamp"], unit='s')
sdf_ratings["Timestamp"] = sdf_ratings["Timestamp"].dt.date
sdf_ratings

         UserID  MovieID  Rating   Timestamp
0             1     1193       5  2000-12-31
1             1      661       3  2000-12-31
2             1      914       3  2000-12-31
3             1     3408       4  2000-12-31
4             1     2355       5  2001-01-06
...         ...      ...     ...         ...
1000204    6040     1091       1  2000-04-26
1000205    6040     1094       5  2000-04-25
1000206    6040      562       5  2000-04-25
1000207    6040     1096       4  2000-04-26
1000208    6040     1097       4  2000-04-26

[1000209 rows x 4 columns]

In [6]:
#Errore 1: Ribadiamo la richiesta di creare una nuova colonna YEAR estrapolandolo dalla colonna Title

sdf["Year"] = sdf["Title"].str.extract(r'\((\d{4})\)', expand = False)
sdf["Title"] = sdf["Title"].str.replace(r'\((\d{4})\)', '', regex = True).str.strip()
sdf

      MovieID                        Title                        Genres  Year
0           1                    Toy Story   Animation|Children's|Comedy  1995
1           2                      Jumanji  Adventure|Children's|Fantasy  1995
2           3             Grumpier Old Men                Comedy|Romance  1995
3           4            Waiting to Exhale                  Comedy|Drama  1995
4           5  Father of the Bride Part II                        Comedy  1995
...       ...                          ...                           ...   ...
3878     3948             Meet the Parents                        Comedy  2000
3879     3949          Requiem for a Dream                         Drama  2000
3880     3950                    Tigerland                         Drama  2000
3881     3951             Two Family House                         Drama  2000
3882     3952               Contender, The                Drama|Thriller  2000

[3883 rows x 4 columns]

In [7]:
#Errore 2: Il film con anno “non_def” , è dell’anno 1995
sdf[sdf["Year"].isna()]
sdf.loc[15, "Year"] = "1995"
sdf.loc[15, "Title"] = sdf.loc[15, "Title"].replace("(not_def)", "").strip()
sdf.loc[15]
sdf["Year"] = pd.to_numeric(sdf["Year"])
sdf["Year"] = sdf["Year"].astype(int)

In [8]:
#Errore 3: Il film senza titolo si intitola “Phantom of the Opera, The”

sdf[sdf["Title"]==""]
sdf.loc[sdf["MovieID"] == 3936, "Title"] = "Phantom of the Opera, The"
sdf[sdf["MovieID"]== 3936]

      MovieID                      Title          Genres  Year
3866     3936  Phantom of the Opera, The  Drama|Thriller  1943

In [9]:
#Errore 4: C’è un film che ha i generi separati da “–” e non da “|” come gli altri, quindi è necessario sistemare l’errore.
sdf['Genres'] = sdf['Genres'].str.replace('--', '|', regex=False)

In [10]:
#Errore 5: Ci sono 5 film di genere “Drama” con un errore ortografico nella parola “Drama” della colonna “Genre”, chiediamo di allinearli agli altri rinominando il genere “Drama”.

sdf.loc[[604, 3248], "Genres"] = "Drama"

In [11]:
#Correzione dei titoli con apici
sdf['Title'] = sdf['Title'].str.replace(r'^"(.+)"$', "", regex=True)
sdf[sdf["Genres"].str.contains("Dramatic")]
sdf.loc[[523, 3340, 3509], "Genres"] = "Drama"

In [12]:
#Creazione degli input per il db movies

table_name = "movie_table"
sql_statements_movies = [
    f"INSERT INTO {table_name} ({', '.join(sdf.columns)}) VALUES ({', '.join(map(repr, row))});"
    for row in sdf.itertuples(index=False, name=None)
]

with open("output_movies.sql", "w") as f:
    f.write("\n".join(sql_statements_movies))

print("\n".join(sql_statements_movies))

INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (1, 'Toy Story', "Animation|Children's|Comedy", 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (2, 'Jumanji', "Adventure|Children's|Fantasy", 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (3, 'Grumpier Old Men', 'Comedy|Romance', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (4, 'Waiting to Exhale', 'Comedy|Drama', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (5, 'Father of the Bride Part II', 'Comedy', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (6, 'Heat', 'Action|Crime|Thriller', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (7, 'Sabrina', 'Comedy|Romance', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (8, 'Tom and Huck', "Adventure|Children's", 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (9, 'Sudden Death', 'Action', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (10, 'GoldenEye', 'Action|Adventure|Thriller', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (11, 'American President, The', 'Comedy|Drama|Romance', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (12, 'Dracula: Dead and Loving It', 'Comedy|Horror', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (13, 'Balto', "Animation|Children's", 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (14, 'Nixon', 'Drama', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (15, 'Cutthroat Island', 'Action|Adventure|Romance', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (16, 'Casino', 'Drama|Thriller', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (17, 'Sense and Sensibility', 'Drama|Romance', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (18, 'Four Rooms', 'Thriller', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (19, 'Ace Ventura: When Nature Calls', 'Comedy', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (20, 'Money Train', 'Action', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (21, 'Get Shorty', 'Action|Comedy|Drama', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (22, 'Copycat', 'Crime|Drama|Thriller', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (23, 'Assassins', 'Thriller', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (24, 'Powder', 'Drama|Sci-Fi', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (25, 'Leaving Las Vegas', 'Drama|Romance', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (26, 'Othello', 'Drama', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (27, 'Now and Then', 'Drama', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (28, 'Persuasion', 'Romance', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (29, 'City of Lost Children, The', 'Adventure|Sci-Fi', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (30, 'Shanghai Triad (Yao a yao yao dao waipo qiao)', 'Drama', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (31, 'Dangerous Minds', 'Drama', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (32, 'Twelve Monkeys', 'Drama|Sci-Fi', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (33, 'Wings of Courage', 'Adventure|Romance', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (34, 'Babe', "Children's|Comedy|Drama", 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (35, 'Carrington', 'Drama|Romance', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (36, 'Dead Man Walking', 'Drama', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (37, 'Across the Sea of Time', 'Documentary', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (38, 'It Takes Two', 'Comedy', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (39, 'Clueless', 'Comedy|Romance', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (40, 'Cry, the Beloved Country', 'Drama', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (41, 'Richard III', 'Drama|War', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (42, 'Dead Presidents', 'Action|Crime|Drama', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (43, 'Restoration', 'Drama', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (44, 'Mortal Kombat', 'Action|Adventure', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (45, 'To Die For', 'Comedy|Drama', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (46, 'How to Make an American Quilt', 'Drama|Romance', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (47, 'Seven (Se7en)', 'Crime|Thriller', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (48, 'Pocahontas', "Animation|Children's|Musical|Romance", 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (49, 'When Night Is Falling', 'Drama|Romance', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (50, 'Usual Suspects, The', 'Crime|Thriller', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (51, 'Guardian Angel', 'Action|Drama|Thriller', 1994);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (52, 'Mighty Aphrodite', 'Comedy', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (53, 'Lamerica', 'Drama', 1994);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (54, 'Big Green, The', "Children's|Comedy", 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (55, 'Georgia', 'Drama', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (56, 'Kids of the Round Table', "Adventure|Children's|Fantasy", 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (57, 'Home for the Holidays', 'Drama', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (58, 'Postino, Il (The Postman)', 'Drama|Romance', 1994);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (59, 'Confessional, The (Le Confessionnal)', 'Drama|Mystery', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (60, 'Indian in the Cupboard, The', "Adventure|Children's|Fantasy", 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (61, 'Eye for an Eye', 'Drama|Thriller', 1996);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (62, "Mr. Holland's Opus", 'Drama', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (63, "Don't Be a Menace to South Central While Drinking Your Juice in the Hood", 'Comedy', 1996);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (64, 'Two if by Sea', 'Comedy|Romance', 1996);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (65, 'Bio-Dome', 'Comedy', 1996);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (66, 'Lawnmower Man 2: Beyond Cyberspace', 'Sci-Fi|Thriller', 1996);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (67, 'Two Bits', 'Drama', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (68, 'French Twist (Gazon maudit)', 'Comedy|Romance', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (69, 'Friday', 'Comedy', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (70, 'From Dusk Till Dawn', 'Action|Comedy|Crime|Horror|Thriller', 1996);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (71, 'Fair Game', 'Action', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (72, 'Kicking and Screaming', 'Comedy|Drama', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (73, 'Misérables, Les', 'Drama|Musical', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (74, 'Bed of Roses', 'Drama|Romance', 1996);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (75, 'Big Bully', 'Comedy|Drama', 1996);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (76, 'Screamers', 'Sci-Fi|Thriller', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (77, 'Nico Icon', 'Documentary', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (78, 'Crossing Guard, The', 'Drama', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (79, 'Juror, The', 'Drama|Thriller', 1996);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (80, 'White Balloon, The (Badkonake Sefid )', 'Drama', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (81, "Things to Do in Denver when You're Dead", 'Crime|Drama|Romance', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (82, "Antonia's Line (Antonia)", 'Drama', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (83, 'Once Upon a Time... When We Were Colored', 'Drama', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (84, 'Last Summer in the Hamptons', 'Comedy|Drama', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (85, 'Angels and Insects', 'Drama|Romance', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (86, 'White Squall', 'Adventure|Drama', 1996);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (87, 'Dunston Checks In', "Children's|Comedy", 1996);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (88, 'Black Sheep', 'Comedy', 1996);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (89, 'Nick of Time', 'Action|Thriller', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (90, 'Journey of August King, The', 'Drama', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (92, 'Mary Reilly', 'Drama|Thriller', 1996);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (93, 'Vampire in Brooklyn', 'Comedy|Romance', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (94, 'Beautiful Girls', 'Drama', 1996);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (95, 'Broken Arrow', 'Action|Thriller', 1996);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (96, 'In the Bleak Midwinter', 'Comedy', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (97, 'Hate (Haine, La)', 'Drama', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (98, 'Shopping', 'Action|Thriller', 1994);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (99, 'Heidi Fleiss: Hollywood Madam', 'Documentary', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (100, 'City Hall', 'Drama|Thriller', 1996);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (101, 'Bottle Rocket', 'Comedy', 1996);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (102, 'Mr. Wrong', 'Comedy', 1996);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (103, 'Unforgettable', 'Thriller', 1996);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (104, 'Happy Gilmore', 'Comedy', 1996);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (105, 'Bridges of Madison County, The', 'Drama|Romance', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (106, 'Nobody Loves Me (Keiner liebt mich)', 'Comedy|Drama', 1994);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (107, 'Muppet Treasure Island', "Adventure|Children's|Comedy|Musical", 1996);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (108, 'Catwalk', 'Documentary', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (109, 'Headless Body in Topless Bar', 'Comedy', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (110, 'Braveheart', 'Action|Drama|War', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (111, 'Taxi Driver', 'Drama|Thriller', 1976);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (112, 'Rumble in the Bronx', 'Action|Adventure|Crime', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (113, 'Before and After', 'Drama|Mystery', 1996);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (114, "Margaret's Museum", 'Drama', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (115, 'Happiness Is in the Field', 'Comedy', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (116, 'Anne Frank Remembered', 'Documentary', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (117, "Young Poisoner's Handbook, The", 'Crime', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (118, 'If Lucy Fell', 'Comedy|Romance', 1996);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (119, 'Steal Big, Steal Little', 'Comedy', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (120, 'Race the Sun', 'Drama', 1996);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (121, 'Boys of St. Vincent, The', 'Drama', 1993);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (122, 'Boomerang', 'Comedy|Romance', 1992);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (123, 'Chungking Express', 'Drama|Mystery|Romance', 1994);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (124, "Star Maker, The (Uomo delle stelle, L')", 'Drama', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (125, 'Flirting With Disaster', 'Comedy', 1996);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (126, 'NeverEnding Story III, The', "Adventure|Children's|Fantasy", 1994);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (127, 'Silence of the Palace, The (Saimt el Qusur)', 'Drama', 1994);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (128, "Jupiter's Wife", 'Documentary', 1994);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (129, 'Pie in the Sky', 'Comedy|Romance', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (130, 'Angela', 'Drama', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (131, 'Frankie Starlight', 'Drama|Romance', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (132, 'Jade', 'Thriller', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (133, 'Nueba Yol', 'Comedy|Drama', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (134, 'Sonic Outlaws', 'Documentary', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (135, 'Down Periscope', 'Comedy', 1996);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (136, 'From the Journals of Jean Seberg', 'Documentary', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (137, 'Man of the Year', 'Documentary', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (138, 'Neon Bible, The', 'Drama', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (139, 'Target', 'Action|Drama', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (140, 'Up Close and Personal', 'Drama|Romance', 1996);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (141, 'Birdcage, The', 'Comedy', 1996);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (142, 'Shadows (Cienie)', 'Drama', 1988);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (143, 'Gospa', 'Drama', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (144, 'Brothers McMullen, The', 'Comedy', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (145, 'Bad Boys', 'Action', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (146, 'Amazing Panda Adventure, The', "Adventure|Children's", 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (147, 'Basketball Diaries, The', 'Drama', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (148, 'Awfully Big Adventure, An', 'Drama', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (149, 'Amateur', 'Crime|Drama|Thriller', 1994);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (150, 'Apollo 13', 'Drama', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (151, 'Rob Roy', 'Drama|Romance|War', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (152, 'Addiction, The', 'Horror', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (153, 'Batman Forever', 'Action|Adventure|Comedy|Crime', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (154, 'Belle de jour', 'Drama', 1967);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (155, 'Beyond Rangoon', 'Drama|War', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (156, 'Blue in the Face', 'Comedy', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (157, 'Canadian Bacon', 'Comedy|War', 1994);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (158, 'Casper', "Adventure|Children's", 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (159, 'Clockers', 'Drama', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (160, 'Congo', 'Action|Adventure|Mystery|Sci-Fi', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (161, 'Crimson Tide', 'Drama|Thriller|War', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (162, 'Crumb', 'Documentary', 1994);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (163, 'Desperado', 'Action|Romance|Thriller', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (164, 'Devil in a Blue Dress', 'Crime|Film-Noir|Mystery|Thriller', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (165, 'Die Hard: With a Vengeance', 'Action|Thriller', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (166, 'Doom Generation, The', 'Comedy|Drama', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (167, 'Feast of July', 'Drama', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (168, 'First Knight', 'Action|Adventure|Drama|Romance', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (169, 'Free Willy 2: The Adventure Home', "Adventure|Children's|Drama", 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (170, 'Hackers', 'Action|Crime|Thriller', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (171, 'Jeffrey', 'Comedy', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (172, 'Johnny Mnemonic', 'Action|Sci-Fi|Thriller', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (173, 'Judge Dredd', 'Action|Adventure|Sci-Fi', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (174, 'Jury Duty', 'Comedy', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (175, 'Kids', 'Drama', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (176, 'Living in Oblivion', 'Comedy', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (177, 'Lord of Illusions', 'Horror', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (178, 'Love & Human Remains', 'Comedy', 1993);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (179, 'Mad Love', 'Drama|Romance', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (180, 'Mallrats', 'Comedy', 1995);
INSERT INTO movie_table (MovieID, Title, Genres, Year) VALUES (181, 'Mighty Morphin Power Rangers: The Movie', "Action|Children's", 1995);

In [13]:
#Creazione degli input per il db users

table_name = "user_table"
sql_statements_users = [
    f"INSERT INTO {table_name} ({', '.join(sdf_users.columns)}) VALUES ({', '.join(map(repr, row))});"
    for row in sdf_users.itertuples(index=False, name=None)
]

with open("output_users.sql", "w") as f:
    f.write("\n".join(sql_statements_users))

print("\n".join(sql_statements_users))

INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (1, 'F', 11, 20023, 'Studente');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (2, 'M', 13, 72022, 'Studente');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (3, 'M', 24, 36100, 'Autista');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (4, 'M', 37, 85024, 'Data Engineer');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (5, 'M', 15, 1010, 'Studente');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (6, 'F', 36, 153, 'Data Scientis');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (7, 'M', 24, 15067, 'Dirigente');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (8, 'M', 28, 44020, 'Avvocato');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (9, 'M', 11, 10126, 'Studente');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (10, 'F', 65, 9010, 'Dirigente');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (11, 'F', 60, 9078, 'Dirigente');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (12, 'M', 31, 95127, 'Avvocato');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (13, 'M', 13, 20139, 'Studente');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (14, 'M', 14, 18, 'Studente');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (15, 'M', 37, 45030, 'Data Engineer');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (16, 'F', 43, 9078, 'Disoccupato');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (17, 'M', 46, 32030, 'Dirigente');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (18, 'F', 26, 33013, 'Direttore');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (19, 'M', 32, 86020, 'Studente');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (20, 'M', 37, 47924, 'Ingegnere');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (21, 'M', 31, 125, 'Attore');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (22, 'M', 45, 34149, 'Autista');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (23, 'M', 19, 14025, 'Disoccupato');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (24, 'F', 43, 35031, 'Data Engineer');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (25, 'M', 16, 33050, 'Studente');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (26, 'M', 30, 10126, 'Data Engineer');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (27, 'M', 51, 32030, 'Infermiere');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (28, 'F', 26, 20139, 'Dirigente');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (29, 'M', 24, 83030, 'Data Engineer');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (30, 'F', 56, 80038, 'Data Engineer');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (31, 'M', 18, 27024, 'Data Engineer');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (32, 'F', 25, 73020, 'Disoccupato');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (33, 'M', 16, 25123, 'Studente');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (34, 'F', 14, 95127, 'Studente');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (35, 'M', 17, 26100, 'Studente');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (36, 'M', 19, 83030, 'Direttore');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (37, 'F', 36, 32030, 'Data Scientis');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (38, 'F', 14, 44020, 'Studente');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (39, 'M', 39, 27024, 'Data Analyst');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (40, 'M', 50, 22072, 'Disoccupato');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (41, 'F', 45, 33048, 'Data Analyst');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (42, 'M', 14, 20023, 'Studente');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (43, 'M', 50, 47924, 'Avvocato');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (44, 'M', 64, 1010, 'Programmatore');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (45, 'F', 22, 3100, 'Attore');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (46, 'M', 24, 71032, 'Musicista');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (47, 'M', 35, 9010, 'Data Analyst');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (48, 'M', 25, 17021, 'Data Analyst');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (49, 'M', 65, 19020, 'Avvocato');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (50, 'F', 32, 33050, 'Operaio');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (51, 'F', 52, 34149, 'Studente');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (52, 'M', 28, 80038, 'Data Analyst');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (53, 'M', 16, 45100, 'Studente');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (54, 'M', 65, 9010, 'Dirigente');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (55, 'F', 58, 21014, 'Avvocato');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (56, 'M', 20, 27024, 'Impiegato');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (57, 'M', 41, 21014, 'Musicista');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (58, 'M', 41, 30020, 'Operaio');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (59, 'F', 29, 40138, 'Dirigente');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (60, 'M', 29, 84070, 'Dirigente');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (61, 'M', 39, 56022, 'Programmatore');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (62, 'F', 34, 26100, 'Direttore');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (63, 'M', 59, 20020, 'Data Analyst');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (64, 'M', 27, 41058, 'Dirigente');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (65, 'M', 45, 73020, 'Avvocato');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (66, 'M', 28, 67069, 'Atleta');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (67, 'F', 14, 26010, 'Studente');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (68, 'M', 20, 84070, 'Data Analyst');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (69, 'F', 57, 22076, 'Dirigente');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (70, 'M', 46, 35124, 'Data Analyst');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (71, 'M', 41, 50055, 'Ingegnere');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (72, 'F', 57, 32030, 'Disoccupato');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (73, 'M', 25, 36012, 'Data Analyst');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (74, 'M', 39, 47030, 'Ingegnere');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (75, 'F', 16, 25043, 'Studente');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (76, 'M', 11, 36012, 'Studente');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (77, 'M', 23, 3100, 'Data Analyst');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (78, 'F', 47, 86020, 'Dirigente');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (79, 'F', 63, 67069, 'Disoccupato');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (80, 'M', 28, 65017, 'Dirigente');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (81, 'F', 39, 86020, 'Disoccupato');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (82, 'M', 25, 33030, 'Programmatore');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (83, 'F', 40, 64023, 'Operaio');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (84, 'M', 31, 76012, 'Data Analyst');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (85, 'M', 13, 36100, 'Studente');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (86, 'F', 26, 35010, 'Studente');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (87, 'M', 26, 47924, 'Ingegnere');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (88, 'F', 65, 35031, 'Dirigente');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (89, 'F', 59, 20139, 'Data Scientis');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (90, 'M', 59, 10126, 'Architetto');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (91, 'M', 39, 33013, 'Data Engineer');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (92, 'F', 62, 85024, 'Data Analyst');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (93, 'M', 37, 33050, 'Programmatore');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (94, 'M', 36, 85024, 'Programmatore');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (95, 'M', 43, 73020, 'Disoccupato');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (96, 'F', 15, 45100, 'Studente');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (97, 'F', 56, 64023, 'Direttore');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (98, 'F', 48, 61029, 'Data Engineer');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (99, 'F', 23, 30020, 'Studente');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (100, 'M', 39, 44121, 'Programmatore');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (101, 'F', 36, 72022, 'Direttore');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (102, 'M', 57, 25043, 'Musicista');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (103, 'M', 48, 45030, 'Data Engineer');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (104, 'M', 56, 33030, 'Avvocato');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (105, 'M', 32, 41058, 'Avvocato');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (106, 'F', 14, 41058, 'Studente');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (107, 'M', 53, 44121, 'Atleta');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (108, 'M', 36, 34149, 'Avvocato');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (109, 'M', 64, 25123, 'Autista');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (110, 'M', 40, 56022, 'Operaio');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (111, 'M', 20, 63100, 'Autista');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (112, 'M', 24, 33013, 'Attore');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (113, 'M', 12, 70026, 'Studente');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (114, 'F', 38, 12032, 'Operaio');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (115, 'M', 33, 10086, 'Programmatore');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (116, 'M', 26, 33048, 'Programmatore');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (117, 'M', 35, 33050, 'Programmatore');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (118, 'M', 51, 44121, 'Programmatore');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (119, 'F', 18, 36012, 'Studente');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (120, 'M', 37, 40061, 'Infermiere');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (121, 'M', 53, 72022, 'Data Engineer');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (122, 'F', 41, 26010, 'Data Analyst');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (123, 'M', 41, 9078, 'Data Scientis');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (124, 'M', 40, 90143, 'Data Engineer');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (125, 'M', 60, 32030, 'Ingegnere');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (126, 'M', 16, 15067, 'Studente');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (127, 'F', 60, 47030, 'Direttore');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (128, 'M', 59, 25043, 'Ricercatore');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (129, 'M', 54, 15063, 'Infermiere');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (130, 'M', 40, 87060, 'Programmatore');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (131, 'M', 56, 45030, 'Data Analyst');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (132, 'M', 63, 36100, 'Programmatore');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (133, 'F', 24, 1010, 'Disoccupato');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (134, 'M', 50, 15063, 'Disoccupato');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (135, 'M', 9, 15077, 'Studente');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (136, 'M', 37, 87060, 'Operaio');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (137, 'F', 27, 10086, 'Ricercatore');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (138, 'M', 59, 125, 'Impiegato');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (139, 'F', 62, 72022, 'Impiegato');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (140, 'F', 25, 33050, 'Dirigente');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (141, 'M', 42, 72022, 'Architetto');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (142, 'M', 58, 90143, 'Data Engineer');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (143, 'M', 26, 24020, 'Direttore');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (144, 'M', 15, 61029, 'Studente');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (145, 'M', 62, 45100, 'Data Analyst');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (146, 'F', 45, 90143, 'Impiegato');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (147, 'M', 27, 24020, 'Data Analyst');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (148, 'M', 29, 65027, 'Programmatore');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (149, 'M', 64, 25043, 'Dirigente');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (150, 'M', 33, 33013, 'Data Engineer');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (151, 'F', 25, 21014, 'Impiegato');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (152, 'M', 54, 65017, 'Data Analyst');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (153, 'M', 54, 87060, 'Studente');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (154, 'M', 49, 14100, 'Impiegato');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (155, 'M', 46, 80038, 'Avvocato');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (156, 'F', 29, 90143, 'Data Engineer');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (157, 'M', 42, 95127, 'Attore');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (158, 'M', 61, 9099, 'Data Engineer');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (159, 'F', 49, 30020, 'Disoccupato');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (160, 'M', 48, 70037, 'Data Engineer');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (161, 'M', 63, 61029, 'Attore');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (162, 'F', 9, 35031, 'Studente');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (163, 'M', 23, 35010, 'Data Analyst');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (164, 'F', 43, 86020, 'Architetto');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (165, 'M', 33, 45030, 'Attore');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (166, 'M', 37, 44121, 'Data Analyst');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (167, 'F', 44, 125, 'Infermiere');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (168, 'F', 38, 9010, 'Disoccupato');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (169, 'M', 26, 18, 'Data Engineer');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (170, 'M', 50, 35124, 'Infermiere');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (171, 'F', 28, 35010, 'Programmatore');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (172, 'M', 40, 10126, 'Direttore');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (173, 'M', 42, 15077, 'Disoccupato');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (174, 'M', 19, 27024, 'Attore');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (175, 'F', 51, 36100, 'Operaio');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (176, 'F', 11, 25043, 'Studente');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (177, 'M', 15, 84070, 'Studente');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (178, 'M', 46, 61029, 'Programmatore');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (179, 'M', 53, 63100, 'Disoccupato');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (180, 'M', 52, 71032, 'Avvocato');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (181, 'M', 17, 26100, 'Studente');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (182, 'M', 14, 61029, 'Studente');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (183, 'F', 57, 36100, 'Dirigente');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (184, 'F', 23, 35124, 'Disoccupato');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (185, 'M', 16, 45100, 'Studente');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (186, 'M', 17, 33050, 'Studente');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (187, 'F', 24, 70026, 'Dirigente');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (188, 'M', 62, 36012, 'Attore');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (189, 'M', 11, 63100, 'Studente');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (190, 'M', 55, 85024, 'Programmatore');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (191, 'M', 36, 40061, 'Data Analyst');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (192, 'M', 57, 17021, 'Dirigente');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (193, 'F', 24, 72022, 'Autista');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (194, 'F', 49, 10086, 'Studente');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (195, 'M', 16, 1010, 'Studente');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (196, 'F', 40, 70026, 'Data Scientis');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (197, 'M', 39, 44020, 'Ingegnere');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (198, 'M', 61, 26100, 'Avvocato');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (199, 'M', 63, 20023, 'Data Analyst');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (200, 'F', 36, 35124, 'Data Analyst');
INSERT INTO user_table (UserID, Gender, Age, CAP, Work) VALUES (201, 'F', 46, 10086, 'Operaio');

In [14]:
#Creazione degli input per il db ratings

#table_name = "ratings_table"
#sql_statements_ratings = [
#    f"INSERT INTO {table_name} ({', '.join(sdf_ratings.columns)}) VALUES ({', '.join(map(repr, row))});"
#    for row in sdf_ratings.itertuples(index=False, name=None)
#]
#
#with open("output_ratings.sql", "w") as f:
#    f.write("\n".join(sql_statements_ratings))
#
#print("\n".join(sql_statements_ratings))

In [15]:
#Installazione di mysql-connector in jupiter

#!pip install mysql-connector-python

In [16]:
#Importazione mysql_connector
import mysql.connector

In [17]:
# Correct way to define configuration
config = {
    'host': "localhost",
    'user': "root",
    'password': "KopiNf23@",
    'database': "on_the_movie"
}

# Establishing connection
with mysql.connector.connect(**config) as conn:
    with conn.cursor() as cursor:
        # Fetch all records from movie_table
        query = "SELECT * FROM movie_table"
        cursor.execute(query)
        records = cursor.fetchall()
        print("Movie Table Records:", records)
#
        query = "SELECT * FROM genres_table"
        cursor.execute(query)
        records = cursor.fetchall()
        print("Genres Table Records:", records)

Movie Table Records: []
Genres Table Records: [(1, 'Animation'), (2, "Children's"), (3, 'Comedy'), (4, 'Adventure'), (5, 'Fantasy'), (6, 'Romance'), (7, 'Drama'), (8, 'Action'), (9, 'Crime'), (10, 'Thriller'), (11, 'Horror'), (12, 'Sci-Fi'), (13, 'Documentary'), (14, 'War'), (15, 'Musical'), (16, 'Mystery'), (17, 'Film-Noir'), (18, 'Western')]

In [18]:
# insert into movie_table
import mysql.connector
with mysql.connector.connect(**config) as conn:
    with conn.cursor() as cursor:
        
        query_movie= "insert into movie_table(MovieID, Title, Genres, Year) values (%s,%s,%s,%s)"
   
        for tupla in sdf.itertuples(index=False, name=None):
            
            cursor.execute(query_movie, (tupla[0],tupla[1],tupla[2],tupla[3]))
    conn.commit()

In [19]:
# insert into users_table
import mysql.connector
with mysql.connector.connect(**config) as conn:
    with conn.cursor() as cursor:
        
        query_users= "insert into users_table(UsersId, Gender, Age, CAP, Work) values (%s,%s,%s,%s,%s)"
   
        for tupla in sdf_users.itertuples(index=False, name=None):
            
            cursor.execute(query_users, (tupla[0],tupla[1],tupla[2],tupla[3],tupla[4]))
    conn.commit()

In [21]:
# insert into users_ratings
with mysql.connector.connect(**config) as conn:
    with conn.cursor() as cursor:
        
        query_ratings= "insert into ratings_table(UserID, MovieID, Rating, Timestamp) values (%s,%s,%s,%s)"
   
        for tupla in sdf_ratings.itertuples(index=False, name=None):
            
            cursor.execute(query_ratings, (tupla[0],tupla[1],tupla[2],tupla[3]))
    conn.commit()

In [22]:
sdf["Genres"].str.split("|").explode().unique()

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [23]:
dizionario = dict(enumerate(sdf["Genres"].str.split("|").explode().unique(), start = 1))
dizionario

{1: 'Animation',
 2: "Children's",
 3: 'Comedy',
 4: 'Adventure',
 5: 'Fantasy',
 6: 'Romance',
 7: 'Drama',
 8: 'Action',
 9: 'Crime',
 10: 'Thriller',
 11: 'Horror',
 12: 'Sci-Fi',
 13: 'Documentary',
 14: 'War',
 15: 'Musical',
 16: 'Mystery',
 17: 'Film-Noir',
 18: 'Western'}

In [24]:
# dizionario = {i + 1: val for i, val in enumerate(sdf["Genres"].str.split("|").explode().unique())}
# dizionario

In [25]:

with mysql.connector.connect(**config) as conn:
    with conn.cursor() as cursor:
        query_movies_genres = "insert into movies_genres (genres_id, movie_id) values (%s,%s)"
        for x in sdf.itertuples(index=False, name=None):
            # print(x)
            for g in dizionario.items():
                if g[1] in x[2]:
                    cursor.execute(query_movies_genres, (g[0], x[0]))
    conn.commit()

In [26]:
# insert into age_ranges
with mysql.connector.connect(**config) as conn:
    with conn.cursor() as cursor:
        cursor.execute("select AgeId, Age_ranges from age_range_table")
        age_ranges = cursor.fetchall()
        age_map = {}
        for age_id, age_range in age_ranges:
            if "<" in age_range:
                min_age = 0
                max_age = int(age_range.replace("<", ""))
            elif ">" in age_range:
                min_age = int(age_range.replace(">", ""))
                max_age = 200
            else:
                min_age, max_age = map(int, age_range.split("-"))

            age_map[age_id] = (min_age, max_age)


        for age_id, (min_age, max_age) in age_map.items():
            update_query = """
            UPDATE users_table 
            SET age_range = %s 
            WHERE Age BETWEEN %s AND %s
            """
            cursor.execute(update_query, (age_id, min_age, max_age))
    

        conn.commit()

In [27]:
import mysql.connector
with mysql.connector.connect(**config) as conn:
    with conn.cursor() as cursor:
        cursor.execute("select * from age_range_table")
        results = cursor.fetchall()
        for a in sdf_users["Age"]:
            query_update = "update users_table set age_range = %s where Age = %s"
            if a < 18:
                cursor.execute(query_update, (results[0][0],a))
            elif a >=18 and a <= 24:
                cursor.execute(query_update, (results[1][0],a))
            elif a >= 25 and a<=34:
                cursor.execute(query_update, (results[2][0],a))
            elif a >= 35 and a<=44:
                cursor.execute(query_update, (results[3][0],a))
            elif a >= 45 and a<=54:
                cursor.execute(query_update, (results[4][0],a))
            else: 
                cursor.execute(query_update, (results[5][0],a))
            
    conn.commit()